##### <span style="color:green">1. Create dataframes </span>
##### <span style="color:green">2. Customize index of a dataframe</span>
#####  <span style="color:green">3. Rearrange the columns in a dataframe</span>
##### <span style="color:green">4. Use an existing column as the index of a dataframe</span>
##### <span style="color:green">5. Access a column in a dataframe</span>
##### <span style="color:green">6. Load financial market data </span>
##### <span style="color:green">7. Dropping rows and/or columns</span>
##### <span style="color:green">8. Rename columns</span>
##### <span style="color:green">9. Sort a dataframe using a column</span>
##### <span style="color:green">10. Just for fun</span>

# Create dataframes 

The underlying idea of a dataframe is based on 'spreadsheets'. In other words, dataframes store data in discrete rows and columns, where each column can be named (something that is not possible in Arrays but is possible in Series). There are also multiple columns in a dataframe (as opposed to Series, where there can be only one discrete indexed column).<br>
<br>
The constructor for a dataframe is <font color=red>pandas.DataFrame(data=None, index=None)</font> or if you are using 'pd' as an alias for pandas, then it would be <font color=red>pd.DataFrame(data=None, index=None)</font><br>
<br>
Let us have a look at the following example.

In [1]:
import numpy as np
import pandas as pd 

my_portfolio = {
                "stock_name": ["Alphabet", "Facebook", "Apple", "Tesla", "Infosys"],
                "quantity_owned": [1564, 6546, 5464, 6513, 4155],
                "average_buy_price": ["$950", "$160", "$120", "$270", "$15"]
               } 

df = pd.DataFrame(my_portfolio)
df.head()

  stock_name  quantity_owned average_buy_price
0   Alphabet            1564              $950
1   Facebook            6546              $160
2      Apple            5464              $120
3      Tesla            6513              $270
4    Infosys            4155               $15

In [2]:
np.array_equal(df["stock_name"],df["stock_name"])

True

In [3]:
# customizing ndex of the data frame 

originals =["first","second","third",'fourth','fifth']

df = pd.DataFrame(my_portfolio,originals)

print(df.head())

id(df)

       stock_name  quantity_owned average_buy_price
first    Alphabet            1564              $950
second   Facebook            6546              $160
third       Apple            5464              $120
fourth      Tesla            6513              $270
fifth     Infosys            4155               $15

2343337296392

## Rearrange the columns in a dataframe 

We can also define or change the order of columns.

In [4]:
df = pd.DataFrame(my_portfolio , originals,columns =["stock_name","average_buy_price","quantity_owned"])
df.head()

       stock_name average_buy_price  quantity_owned
first    Alphabet              $950            1564
second   Facebook              $160            6546
third       Apple              $120            5464
fourth      Tesla              $270            6513
fifth     Infosys               $15            4155

## Use an existing column as an index of a dataframe

We will use the column 'stock_name' as the index of the dataframe.

In [5]:
my_portfolio_frame = pd.DataFrame (my_portfolio, 
                                   columns = ["quantity_owned","average_buy_price"],
                                   index = my_portfolio ["stock_name"])
print(df.head())
my_portfolio_frame

       stock_name average_buy_price  quantity_owned
first    Alphabet              $950            1564
second   Facebook              $160            6546
third       Apple              $120            5464
fourth      Tesla              $270            6513
fifth     Infosys               $15            4155

          quantity_owned average_buy_price
Alphabet            1564              $950
Facebook            6546              $160
Apple               5464              $120
Tesla               6513              $270
Infosys             4155               $15

## Access a column in a dataframe 

You can access or retrieve a single or multiple columns by their names or by their location.

In [6]:
print(df["quantity_owned"])
print(df.quantity_owned)

first     1564
second    6546
third     5464
fourth    6513
fifth     4155
Name: quantity_owned, dtype: int64
first     1564
second    6546
third     5464
fourth    6513
fifth     4155
Name: quantity_owned, dtype: int64

## Load financial market data

This is a recap from the section 'Importing Data and Data Visualisation'. We have done this in a <b>pd.read_csv()</b> iPython notebook.

In [7]:
bk = pd.read_csv(r"C:\Users\ramsu\ltphd\banknifty_feb Future daily.csv")

print(bk.head())
print(bk.tail())
type(bk)

              Ticker          Date/Time      Open      High       Low  \
0  BANKNIFTY20FEBFUT  20-01-02 00:00:00  32444.85  32711.15  32394.00
1  BANKNIFTY20FEBFUT  20-01-03 00:00:00  32510.00  32539.70  32184.40
2  BANKNIFTY20FEBFUT  20-01-06 00:00:00  32080.20  32109.70  31403.95
3  BANKNIFTY20FEBFUT  20-01-07 00:00:00  31740.30  32018.45  31410.00
4  BANKNIFTY20FEBFUT  20-01-08 00:00:00  31191.95  31645.60  31067.15

      Close  Volume
0  32685.85   25920
1  32266.85   37860
2  31474.10   63980
3  31598.55   60220
4  31559.05   72340
               Ticker          Date/Time      Open      High       Low  \
34  BANKNIFTY20FEBFUT  20-02-18 00:00:00  30655.85  30707.15  30282.55
35  BANKNIFTY20FEBFUT  20-02-19 00:00:00  30875.00  30940.00  30652.00
36  BANKNIFTY20FEBFUT  20-02-20 00:00:00  30784.00  31098.40  30698.60
37  BANKNIFTY20FEBFUT  20-02-24 00:00:00  30615.00  30688.80  30393.35
38  BANKNIFTY20FEBFUT  20-02-25 00:00:00  30500.05  30631.10  30365.00

      Close   Volume
34  30581.4  3223260
35  30856.4  2785900
36  30938.7  3124380
37  30423.0  3124800
38  30479.6  1955980

pandas.core.frame.DataFrame

## Dropping rows and/or columns 

In the above Infosys stock data, it is not necessary that you need all the columns which are present in the .csv file. Hence, to make your dataframe more understandable, you may drop the columns that you do not need using drop function.<br>
<br>
General Syntax for dropping columns:<br>
<pre>DataFrame.drop(['Column_name'])</pre>
General Syntax for dropping rows:<br>
<pre>DataFrame.drop(DataFrame.index[[x,y,z...]]</pre>
where x,y,z are row index values

In [8]:
bk_new=bk.drop(columns = ['Volume'])
bk_new.head()

,Ticker,Date/Time,Open,High,Low,Close
0,BANKNIFTY20FEBFUT,20-01-02 00:00:00,32444.85,32711.15,32394.00,32685.85
1,BANKNIFTY20FEBFUT,20-01-03 00:00:00,32510.00,32539.70,32184.40,32266.85
2,BANKNIFTY20FEBFUT,20-01-06 00:00:00,32080.20,32109.70,31403.95,31474.10
3,BANKNIFTY20FEBFUT,20-01-07 00:00:00,31740.30,32018.45,31410.00,31598.55
4,BANKNIFTY20FEBFUT,20-01-08 00:00:00,31191.95,31645.60,31067.15,31559.05

In [9]:
bk_new.drop(bk_new.index[[2,3,4]]).head()

              Ticker          Date/Time      Open      High      Low     Close
0  BANKNIFTY20FEBFUT  20-01-02 00:00:00  32444.85  32711.15  32394.0  32685.85
1  BANKNIFTY20FEBFUT  20-01-03 00:00:00  32510.00  32539.70  32184.4  32266.85
5  BANKNIFTY20FEBFUT  20-01-09 00:00:00  31874.10  32307.00  31874.1  32265.90
6  BANKNIFTY20FEBFUT  20-01-10 00:00:00  32313.30  32489.55  32100.0  32231.90
7  BANKNIFTY20FEBFUT  20-01-13 00:00:00  32313.25  32490.00  32245.0  32354.95

## Rename columns
 
If we want to rename the column names, while dealing with the dataframe we need to use the rename function.

In [10]:
bk_new.rename(columns = { "Date/Time" : "DT"}).head()

,Ticker,DT,Open,High,Low,Close
0,BANKNIFTY20FEBFUT,20-01-02 00:00:00,32444.85,32711.15,32394.00,32685.85
1,BANKNIFTY20FEBFUT,20-01-03 00:00:00,32510.00,32539.70,32184.40,32266.85
2,BANKNIFTY20FEBFUT,20-01-06 00:00:00,32080.20,32109.70,31403.95,31474.10
3,BANKNIFTY20FEBFUT,20-01-07 00:00:00,31740.30,32018.45,31410.00,31598.55
4,BANKNIFTY20FEBFUT,20-01-08 00:00:00,31191.95,31645.60,31067.15,31559.05

## Sort a dataframe using a column 

Sometimes it becomes necessary to sort a stock price dataframe, based on the 'Closing Price'.

In [11]:
#bk_new.Close=np.sort(bk_new.Close)

# print(bk_new.Close.head())
# bk_new.head(20)

# """I have corruped the data doing this """

bk_new.head()

,Ticker,Date/Time,Open,High,Low,Close
0,BANKNIFTY20FEBFUT,20-01-02 00:00:00,32444.85,32711.15,32394.00,32685.85
1,BANKNIFTY20FEBFUT,20-01-03 00:00:00,32510.00,32539.70,32184.40,32266.85
2,BANKNIFTY20FEBFUT,20-01-06 00:00:00,32080.20,32109.70,31403.95,31474.10
3,BANKNIFTY20FEBFUT,20-01-07 00:00:00,31740.30,32018.45,31410.00,31598.55
4,BANKNIFTY20FEBFUT,20-01-08 00:00:00,31191.95,31645.60,31067.15,31559.05

In [12]:
bk_new = bk_new.sort_values(by= "Close",ascending = False)
print(bk_new.head())

"Data is not corrupted"

              Ticker          Date/Time      Open      High      Low     Close
0  BANKNIFTY20FEBFUT  20-01-02 00:00:00  32444.85  32711.15  32394.0  32685.85
7  BANKNIFTY20FEBFUT  20-01-13 00:00:00  32313.25  32490.00  32245.0  32354.95
8  BANKNIFTY20FEBFUT  20-01-14 00:00:00  32307.75  32363.25  32154.8  32282.80
1  BANKNIFTY20FEBFUT  20-01-03 00:00:00  32510.00  32539.70  32184.4  32266.85
5  BANKNIFTY20FEBFUT  20-01-09 00:00:00  31874.10  32307.00  31874.1  32265.90

'Data is not corrupted'

In [13]:
names = ['Jay', 'Varun', 'Devang', 'Ishan', 'Vibhu']

months = ["January", "February", "March",
         "April", "May", "June",
         "July", "August", "September",
         "October", "November", "December"]

df = pd.DataFrame(np.random.randn (12, 5)*10000, columns = names, index = months)

df.head()

                  Jay         Varun        Devang        Ishan        Vibhu
January     87.391348  -3539.928946 -19045.217959 -3124.391999  7169.691272
February  8575.612982  -7029.204992  11441.185341  2978.403243  4061.119422
March    -3216.217931  15306.868386  12303.092593  4134.097096 -9883.118718
April    -1817.626771 -21713.043825 -13594.449913   938.960751  3387.526484
May      -9262.073810   5380.278223  12968.006264 -8470.150093   464.573809